app/controllers/sitedposts_controller.rb

  def index
    @sitedposts = Sitedpost.all
---
SELECT "sitedposts".* FROM "sitedposts"

  def create
    @sitedpost = Sitedpost.new(sitedpost_params)

    respond_to do |format|
      if @sitedpost.save
---
INSERT INTO "sitedposts" ("content", "date", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asdas"], ["date", "dasd"], ["position", "dsadsa"], ["created_at", "2018-08-01 02:05:01.079542"], ["updated_at", "2018-08-01 02:05:01.079542"]]

  def destroy
    @sitedpost.destroy
---
DELETE FROM "sitedposts" WHERE "sitedposts"."id" = ?  [["id", 1]]

    def set_sitedpost
      @sitedpost = Sitedpost.find(params[:id])
---
SELECT  "sitedposts".* FROM "sitedposts" WHERE "sitedposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]